---
kind: property
id: P:Autodesk.Revit.DB.RoutingConditions.IsValidObject
source: html/a209e1ca-e1c6-1743-8dac-2aed9373585f.htm
---
# Autodesk.Revit.DB.RoutingConditions.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.